
// JavaScript最常见也最显著的用途之一是在网页上添加动画，从而在视觉上更具吸引力
// 翻转器(rollover)效果
// 自动改变图像、创建广告条、建立幻灯片和在页面上显示随机图像。

// 表4-1 目前需要了解的HTML 知识——图像
// 标 签 		属 性 			意 义
// img 							其中包含描述浏览器要显示的图像的属性
// 				src 			包含图像的URL，这个URL 是相对于网页的URL 来说的
// 				width 			包含浏览器显示图像所用的宽度（以像素为单位）
// 				height 			包含浏览器显示图像所用的高度（以像素为单位）
// 				alt 			用来在非图形化浏览器中替代图像
// 				id 				唯一标识符，JavaScript 将用它来操纵图像


// 创建翻转器
// 第一个图像是原始(original)图像，它与网页的其他部分一起加载和显示
// 鼠标移动到第一个图像上时，第二个图片换上，即替换(replacement)图像，这样就产生了运动或动画效果。











































